Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: See also hw_pipedocument(), hw_free_document(), hw_document_bodytag(), hw_document_size(), hw_output_document(), hw_gettext().
es: Vea también hw_PipeDocument(), hw_FreeDocument(), hw_DocumentBodyTag(), hw_DocumentSize(), hw_OutputDocument(), hw_GetText().

source: Returns the last error number.
es: Devuelve el último número de error.

source: If the return value is 0 no error has occurred.
es: Si el valor devuelto es 0 no ha habido errores.

source: The error relates to the last command.
es: El error está relacionado con el último comando.

source: Returns a string containing the last error message or 'No Error'.
es: Devuelve una cadena que contiene el último mensaje de error o 'No Error'.

source: If FALSE is returned, this function failed.
es: Si devuelve FALSE es que la función fracasó.

source: The message relates to the last command.
es: El mensaje está relacionado con el último comando.

source: Frees the memory occupied by the Hyperwave document.
es: Libera la memoria ocupada por el documento Hyperwave.

source: Returns an array of object ids with anchors of the document with object ID objectID.
es: Devuelve una tabla de id de objeto con los enlaces del documento cuyo ID es IDobjeto.

source: Returns an array of object records with anchors of the document with object ID objectID.
es: Devuelve una tabla de registros de objeto con los enlaces del documento cuyo ID es IDobjeto.

source: Returns the object record for the object with ID objectID.
es: Devuelve el registro de objeto para el objeto con ID IDobjeto.

source: It will also lock the object, so other users cannot access it until it is unlocked.
es: También bloqueará el objeto, de modo que otros usuarios no podrán acceder al mismo hasta que sea desbloqueado.

source: See also hw_unlock(), and hw_getobject().
es: Vea también hw_Unlock(), hw_GetObject().

source: Each object ID belongs to a child collection of the collection with ID objectID.
es: Cada ID de objeto pertenece a una colección hija de la colección con ID IDobjeto.

source: The function will not return child documents.
es: La función no devolverá documentos hijos.

source: See also hw_children(), and hw_getchilddoccoll().
es: Vea también hw_GetChildren(), hw_GetChildDocColl().

source: Each object records belongs to a child collection of the collection with ID objectID.
es: Cada uno de ellos pertenece a una colección hija de la colección con ID IDobjeto.

source: See also hw_childrenobj(), and hw_getchilddoccollobj().
es: Vea también hw_ChildrenObj(), hw_GetChildDocCollObj().

source: Returns array of object ids for child documents of a collection.
es: Devuelve una tabla de id de objeto para los documentos hijos de una colección.

source: See also hw_children(), and hw_getchildcoll().
es: Vea también hw_GetChildren(), hw_GetChildColl().

source: Returns an array of object records for child documents of a collection.
es: Devuelve una tabla de registros de objeto para los documentos hijos de una colección.

source: See also hw_childrenobj(), and hw_getchildcollobj().
es: Vea también hw_ChildrenObj(), hw_GetChildCollObj().

source: Searches for objects in collection with ID objectID and returns an array of object ids.
es: Busca objetos en la colección cuyo ID es IDobjeto y devuelve una tabla de ID de objeto.

source: The maximum number of matches is limited to max_hits.
es: El número máximo de resultados será max_resultados.

source: If max_hits is set to -1 the maximum number of matches is unlimited.
es: Si max_resultados vale -1, el número máximo de resultados es ilimitado.

source: The query will only work with indexed attributes.
es: La consulta funcionará sólo con atributos indizados.

source: See also hw_getobjectbyquerycollobj().
es: Vea también hw_GetObjectByQueryCollObj().

source: Searches for objects in collection with ID objectID and returns an array of object records.
es: Busca objetos en la colección cuyo ID es IDobjeto y devuelve una tabla de registros de objeto.

source: See also hw_getobjectbyquerycoll().
es: Vea también hw_GetObjectByQueryColl().

source: Searches for objects on the whole server and returns an array of object ids.
es: Busca objetos en todo el servidor y devuelve una tabla de id de objeto.

source: See also hw_getobjectbyqueryobj().
es: Vea también hw_GetObjectByQueryObj().

source: Searches for objects on the whole server and returns an array of object records.
es: Busca objetos en todo el servidor y devuelve una tabla de registros de objeto.

source: See also hw_getobjectbyquery().
es: Vea también hw_GetObjectByQuery().

source: Returns the object record for the object with ID objectID if the second parameter is an integer.
es: Devuelve el registro de objeto para el objeto cuyo ID es IDobjeto si el segundo parámetro es un entero.

source: If the second parameter is an array of integer the function will return an array of object records.
es: Si es una tabla la función devolverá una tabla de registros de objeto.

source: In such a case the last parameter is also evaluated which is a query string.
es: En tal caso, el último parámetro, que es una cadena de consulta, también es evaluado.

source: The query string has the following syntax:
es: La cadena de consulta tiene la sintáxis siguiente:

source: "!" expr _BAR_ / * NOT * /
es: "!" expr _BAR_ / * NO * /

source: expr "_BAR__BAR_" expr _BAR_ / * OR * /
es: expr "_BAR__BAR_" expr _BAR_ / * O * /

source: expr "" expr _BAR_ / * AND * /
es: expr "" expr _BAR_ / * Y * /

source: attribute operator value
es: atributo operador valor

source: attribute ::= / * any attribute name (Title, Author, DocumentType...) * /
es: atributo ::= / * cualquier atributo (Título, Autor, TipoDocumento...) * /

source: operator ::= "=" _BAR_ / * equal * /
es: operador ::= "=" _BAR_ / * igual * /

source: "" _BAR_ / * less than (string compare) * /
es: "" _BAR_ / * menor que (comparación de cadenas) * /

source: "" _BAR_ / * greater than (string compare) * /
es: "" _BAR_ / * mayor que (comparación de cadenas) * /

source: "~" / * regular expression matching * /
es: "~" / * expresión regular * /

source: The query allows to further select certain objects from the list of given objects.
es: La consulta permite seleccionar elementos de la lista de objetos dada.

source: Unlike the other query functions, this query may use not indexed attributes.
es: Al contrario de otras funciones de búsqueda, esta consulta no puede utilizar atributos indizados.

source: How many object records are returned depends on the query and if access to the object is allowed.
es: El número de registros de objeto devueltos depende de la consulta y de si está permitido el acceso al objeto.

source: See also hw_getandlock(), and hw_getobjectbyquery().
es: Vea también hw_GetAndLock(), hw_GetObjectByQuery().

source: Returns an indexed array of object ids.
es: Devuelve una tabla indizada de id de objeto.

source: Each object id belongs to a parent of the object with ID objectID.
es: Cada una pertenece a un padre del objeto con ID IDobjeto.

source: Returns an indexed array of object records plus an associated array with statistical information about the object records.
es: Devuelve una tabla indizada de registros de objeto junto a una tabla asociativa con información estadística sobre estos.

source: The associated array is the last entry of the returned array.
es: La tabla asociativa es el último elemento de la tabla devuelta.

source: Each object record belongs to a parent of the object with ID objectID.
es: Cada registro de objeto pertenece a un padre del objeto con ID IDobjeto.

source: Returns the children of a remote document.
es: Devuelve el hijo de un documento remoto.

source: Children of a remote document are remote documents itself.
es: Los hijos de documentos remotos son en sí mismos documentos remotos.

source: This makes sense if a database query has to be narrowed and is explained in Hyperwave Programmers' Guide.
es: Esto tiene sentido cuando se afina una consulta de bases de datos y se explica en la Guía de Programación de Hyperwave.

source: If the number of children is 1 the function will return the document itself formated by the Hyperwave Gateway Interface (HGI).
es: Si el número de hijos es 1 la función devolverá el documento en sí mismo formateado con la Interfaz de Pasarela de Hyperwave (HGI).

source: If the number of children is greater than 1 it will return an array of object record with each maybe the input value for another call to hw_getremotechildren().
es: Si el número de hijos es mayor de 1 devolverá una tabla de registros de objeto, con cada uno posible candidato para otra llamada a hw_GetRemoteChildren().

source: Those object records are virtual and do not exist in the Hyperwave server, therefore they do not have a valid object ID.
es: Dichos registros de objeto son virtuales y no existen en el servidor Hyperwave, y por lo tanto no poseen un ID de objeto válido.

source: How exactely such an object record looks like is up to the HGI.
es: La apariencia exacta de dicho registro de objeto depende del HGI.

source: If you want to use this function you should be very familiar with HGIs.
es: Si desea usar esta función deberá estar muy familiarizado con los HGI.

source: You should also consider to use PHP instead of Hyperwave to access external sources.
es: También debería considerar el uso del PHP en lugar de Hyperwave para acceder a fuentes externas.

source: Adding database support by a Hyperwave gateway should be more difficult than doing it in PHP.
es: Añadir soporte de bases de datos a través de una pasarela de Hyperwave resulta más difícil que hacerlo en PHP.

source: See also hw_getremote().
es: Vea también hw_GetRemote().

source: Returns a remote document.
es: Devuelve un documento remoto.

source: Remote documents in Hyperwave notation are documents retrieved from an external source.
es: Los documentos remotos en la notación de Hyperwave son los obtenidos de una fuente externa.

source: Common remote documents are for example external web pages or queries in a database.
es: Los documentos remotos típicos son páginas web externas o consultas a bases de datos.

source: In order to be able to access external sources throught remote documents Hyperwave introduces the HGI (Hyperwave Gateway Interface) which is similar to the CGI.
es: Para poder acceder a las fuentes externas a través de documentos remotos, el Hyperwave presenta el HGI (Hyperwave Gateway Interface - Interfaz de Pasarela de Hyperwave) que es similar al CGI.

source: Currently, only ftp, http-servers and some databases can be accessed by the HGI.
es: Actualmente, sólo se puede acceder a servidores ftp y http y a algunas bases de datos.

source: Calling hw_getremote() returns the document from the external source.
es: Llamar a hw_GetRemote() devuelve el documento de la fuente externa.

source: See also hw_getremotechildren().
es: Vea también hw_GetRemoteChildren().

source: Returns the object records of all anchors pointing to the object with ID objectID.
es: Devuelve los registros de objeto de todos los enlaces que apuntan al objeto con ID IDobjeto.

source: The object can either be a document or an anchor of type destination.
es: El objeto puede ser tanto un documento como un enlace de tipo destino.

source: See also hw_getanchors().
es: Vea también hw_GetAnchors().

source: Returns the document with object ID objectID.
es: Devuelve el documento con ID de objeto IDobjeto.

source: If the document has anchors which can be inserted, they will be inserted already.
es: Si el documento tiene enlaces que pueden ser insertados, serán insertados ahora.

source: The optional parameter rootID / prefix can be a string or an integer.
es: El parámetro opcional IDraiz / prefijo puede ser una cadena o un entero.

source: If it is an integer it determines how links are inserted into the document.
es: Si es un entero determina la forma en que los enlaces se insertan en el documento.

source: The default is 0 and will result in links that are constructed from the name of the link 's destination object.
es: Por defecto es 0 y los enlaces se crean a partir del nombre del objeto de destino de los mismos.

source: This is useful for web applications.
es: Esto es útil para aplicaciones web.

source: If a link points to an object with name 'internet_movie' the HTML link will be A HREF=" / internet_movie ".
es: Si un enlace apunta a un objeto con nombre 'pelicula_internet' el enlace HTML será A HREF=" / pelicula_internet ".

source: The actual location of the source and destination object in the document hierachy is disregarded.
es: La posición actual del objeto de destino en la jerarquía de documentos es despreciada.

source: You will have to set up your web browser, to rewrite that URL to for example '/ my_script.php3 / internet_movie'. 'my_script.php3' will have to evaluate $PATH_INFO and retrieve the document.
es: Tendrá que ajustar su navegador web para que reescriba dicho URL a, por ejemplo, '/ mi_script.php3 / pelicula_internet'. 'mi_script.php3' deberá evaluar $PATH_INFO y recuperar el documento.

source: All links will have the prefix '/ my_script.php3 /'.
es: Todos los enlaces tendrán el prefijo '/ mi_script.php3'.

source: If you do not want this you can set the optional parameter rootID / prefix to any prefix which is used instead.
es: Si no desea este efecto puede fijar el parámetro opcional IDraiz / prefijo al prefijo que desee en su lugar.

source: Is this case it has to be a string.
es: En este caso deberá ser una cadena.

source: If rootID / prefix is an integer and unequal to 0 the link is constructed from all the names starting at the object with the id rootID / prefix separated by a slash relative to the current object.
es: Si el IDraiz / prefijo es un entero distinto de 0, el enlace se construye con todos los nombres de objeto comenzando con el objeto de id IDraiz / prefijo, separado por una barra relativa al objeto actual.

source: If for example the above document 'internet_movie' is located at'a-b-c-internet_movie 'with' - 'being the seperator between hierachy levels on the Hyperwave server and the source document is located at'a-b-d-source' the resulting HTML link would be:
es: Si por ejemplo el documento anterior 'pelicula_internet' está situado en 'a-b-c-pelicula_internet 'donde' - 'es el separador entre niveles jerárquicos en el servidor Hyperwave y el documento fuente está situado en 'a-b-d-fuente', el enlace HTML resultante sería:

source: A HREF=".. / c/internet_movie ".
es: A HREF=".. / c/pelicula_internet ".

source: This is useful if you want to download the whole server content onto disk and map the document hierachy onto the file system.
es: Esto es útil cuando desea bajarse el contenido completo del servidor al disco y mapear la jerarquía de documentos en el sistema de archivos.

source: This function will only work for pure text documents.
es: Esta función sólo trabajará en documentos de texto puros.

source: See also hw_pipedocument(), hw_free_document(), hw_document_bodytag(), hw_document_size(), and hw_output_document().
es: Vea también hw_PipeDocument(), hw_FreeDocument(), hw_DocumentBodyTag(), hw_DocumentSize(), hw_OutputDocument().

source: hw_getusername
es: hw_Username

source: (PHP 3 = 3.0.3, PHP 4)
es: (no version information, might be only in CVS)

source: Returns the username of the connection.
es: Devuelve el nombre de usuario de la conexión.

source: Identifies as user with username and password.
es: Le identifica como el usuario nombre y clave.

source: Identification is only valid for the current session.
es: La identificación sólo es válida para la sesión actual.

source: I do not thing this function will be needed very often.
es: No pienso que esta función sea necesaria con mucha frecuancia.

source: In most cases it will be easier to identify with the opening of the connection.
es: En muchos casos será más fácil identificarse al abrir la conexión.

source: See also hw_connect().
es: Vea también hw_Connect().

source: Checks whether a set of objects (documents or collections) specified by the object_id_array is part of the collections listed in collection_id_array.
es: Comprueba si el conjunto de objetos (documentos o colecciones) especificado por el parámetro tabla_id_objeto es parte de las colecciones enumeradas en tabla_id_colecciones.

source: When the fourth parameter return_collections is 0, the subset of object ids that is part of the collections (i.e., the documents or collections that are children of one or more collections of collection ids or their subcollections, recursively) is returned as an array.
es: Cuando el cuarto parámetro colecciones_devueltas es 0, el subconjunto de id de objeto que es parte de las colecciones (es decir, los documentos o colecciones hijos de una o más colecciones de id de colecciones o de sus subcolecciones, recursivamente) es devuelto en forma de tabla.

source: When the fourth parameter is 1, however, the set of collections that have one or more objects of this subset as children are returned as an array.
es: Cuando el cuarto parámetro es 1, sin embargo, el conjunto de colecciones que tienen uno o más objetos de este subconjunto como hijos es devuelto como tabla.

source: This option allows a client to, e.g., highlight the part of the collection hierarchy that contains the matches of a previous query, in a graphical overview.
es: Esta opción permite a un cliente, p. ej., remarcar en una visualización gráfica la parte de la jerarquía de colecciones que contiene las coincidencias de una consulta previa.

source: Returns information about the current connection.
es: Devuelve información sobre la conexión actual.

source: The returned string has the following format:
es: La cadena devuelta tiene el siguiente formato:

source: Serverstring, Host, Port, Username, Port of Client, Byte swapping
es: Cadenaservidor, Anfitrión, Puerto, Usuario, Puerto del Usuario, Intercambio de bytes

source: Inserts a new collection with attributes as in object_array into collection with object ID objectID.
es: Inserta una nueva colección con los atributos de la tabla_objetos en la colección cuyo ID de objeto es IDobjeto.

source: Inserts a new document with attributes as in object_record into collection with object ID parentID.
es: Inserta un nuevo documento con los atributos del registro_de_objeto en la colección cuyo ID de objeto es IDpadre.

source: If you want to insert a general document of any kind use hw_insertdocument() instead.
es: Esta función inserta tanto un registro de objeto sólo como un registro de objeto y el texto puro en ASCII dado en texto si este es especificado. si desea insertar un documento general de cualquier tipo, utilice en su lugar hw_insertdocument().

source: See also hw_insertdocument(), and hw_inscoll().
es: Vea también hw_InsertDocument(), hw_InsColl().

source: Uploads a document into the collection with parent_id.
es: Sube un documento a la colección dada por id_padre.

source: The document has to be created before with hw_new_document().
es: El documento debe ser creado antes con la función hw_NewDocument().

source: Make sure that the object record of the new document contains at least the attributes:
es: Asegúrese que el registro de objeto del nuevo documento contenga al menos los atributos:

source: Type, DocumentType, Title and Name.
es: Type, DocumentType, Title y Name (así, en inglés).

source: Possibly you also want to set the MimeType.
es: Posiblemente desee fijar también el MimeType.

source: The functions returns the object id of the new document or FALSE.
es: La función devuelve la id de objeto del nuevo documento, o FALSE.

source: See also hw_pipedocument().
es: Vea también hw_PipeDocument().

source: Inserts an object into the server.
es: Inserta un objeto en el servidor.

source: The object can be any valid hyperwave object.
es: Este puede consistir en cualquier objeto hyperwave válido.

source: See the HG-CSP documentation for a detailed information on how the parameters have to be.
es: Vea la documentación sobre el HG-CSP si desea información detallada sobre cuáles tienen que ser los parámetros.

source: If you want to insert an Anchor, the attribute Position has always been set either to a start / end value or to 'invisible'.
es: Si se desea insertar un enlace, el atributo Position siempre se fijará a un valor comienzo / final o a 'invisible'.

source: Invisible positions are needed if the annotation has no correspondig link in the annotation text.
es: Las posiciones invisibles se necesitan si la anotación no tiene enlace correspondiente en el texto anotado.

source: See also hw_pipedocument(), hw_insertdocument(), hw_insdoc(), and hw_inscoll().
es: Vea también hw_PipeDocument(), hw_InsertDocument(), hw_InsDoc(), hw_InsColl().

source: Maps a global object id on any hyperwave server, even those you did not connect to with hw_connect(), onto a virtual object id.
es: Mapea un id de objeto global en un servidor hyperwave, incluso con aquellos a los que no se ha conectado con hw_connect(), sobre un id virtual de objeto.

source: This virtual object id can then be used as any other object id, e.g. to obtain the object record with hw_getobject().
es: Este id virtual se puede utilizar como cualquier otro id de objeto, p. ej. para obtener el registro de objeto por medio de hw_getobject().

source: The server id is the first part of the global object id (GOid) of the object which is actually the IP number as an integer.
es: El id de servidor es la primera parte del id global de objeto (GOid) de aquel que es realmene el número IP expresado como entero.

source: In order to use this function you will have to set the F_DISTRIBUTED flag, which can currently only be set at compile time in hg_comm.c.
es: Para usar esta función deberá activar el indicador F_DISTRIBUTED, que actualmenes sólo se puede fijar en tiempo de compilación desde hg_comm.c.

source: It is not set by default.
es: Por defecto está inactivo.

source: Read the comment at the beginning of hg_comm.c
es: Lea el comentario al principio de hg_comm.c

source: This command allows to remove, add, or modify individual attributes of an object record.
es: Este comando permite eliminar, añadir, o modificar atributos individuales de un registro de objeto.

source: The object is specified by the Object ID object_to_change.
es: El objeto está especificado por el ID de objeto objeto_a_cambiar.

source: The first array remove is a list of attributes to remove.
es: La primera tabla, eliminar, es la lista de atributos a eliminar.

source: The second array add is a list of attributes to add.
es: La segunda tabla, añadir, es la lista de atributos a añadir.

source: In order to modify an attribute one will have to remove the old one and add a new one. hw_modifyobject() will always remove the attributes before it adds attributes unless the value of the attribute to remove is not a string or array.
es: Para modificar un atributo, hay que borrar el antiguo y añadir uno nuevo. hw_modifyobject() siempre eliminará los atributos antes de añadir los nuevos excepto si el valor del atributo a eliminar no es una cadena o una tabla.

source: The last parameter determines if the modification is performed recursively.
es: El último parámetro determina si la modificación se realiza de manera recursiva.

source: 1 means recurive modification.
es: 1 quiere decir que sea recursiva.

source: If some of the objects cannot be modified they will be skiped without notice. hw_error() may not indicate an error though some of the objects could not be modified.
es: Incluso hw_error() podría no indicar un error aunque alguno de los objetos no pueda ser modificado.

source: The keys of both arrays are the attributes name.
es: Las claves de ambas tablas son los nombres de los atributos.
